
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"960f0a559f1a5fcf74f14a4c75d4324e4c3c0e1e350d0002cc2b2378931291d7\"" -> "W/\"91892bc6a7d84ee49c7a3a6a49ca6a7ced0d0b8943077e69b1a6add2822abab9\""
        id          = "1393928"
        name        = "protect-main-branch-kong-build-images-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"54db1223c5efb71ccff5d166feb072fad30b6174741d79ae2770e7270badb15e\"" -> "W/\"c382dbb4499e5f8e3b11313acafc65ac97823e93dc35946f0235510e2ee5da79\""
        id          = "1393927"
        name        = "protect-main-branch-kong-openssl-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"de7c42c435ede113273b3098087a481f1553e513c3acf5e0576efc80b12f700d\"" -> "W/\"61b46b3dd08bb96bbb23adf9ffb0410c575e4f6dbd647f8198c4ac83676550a8\""
        id          = "1393918"
        name        = "protect-main-branch-kong-runtime-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"bebe4b242026bdcbb62c5eec27ebb01b0ed49885474517bebc7e7af86991e095\"" -> "W/\"93a6302abe788d8d4812a1b17a438d3f40d138e6624a6d7ba15903627a71bddd\""
        id          = "1393934"
        name        = "protect-main-branch-template-1-github-release-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"d45bbd034bf75ccea28f3331522c8a3b20cd4682450bbc498b7a94e2dc1e0662\"" -> "W/\"d50da574c4b6e38334e30815d2b1081edfe998f6580cf0508871e7eccb72551a\""
        id          = "1393937"
        name        = "protect-main-branch-template-1-terraform-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-template"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"ddce44e038a9824a231ff9ea553b59bf7a67a69b1599fbcd4c7f21cf3464e1ec\"" -> "W/\"003f95d69e35a14b03ebfeef210fd5291582aa2c17ac6fbc877a75afcd8bbfd4\""
        id          = "1393936"
        name        = "protect-main-branch-template-template-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"36dac9d018663fe490fb337e489f72daced1e1a0f5e83fff7f99106fa4e37589\"" -> "W/\"30381531d8cfba68f0bced15d480415c72ba53acf2e89457a7fc4b82784dca03\""
        id          = "1393924"
        name        = "protect-main-branch-kong-build-images-release"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"5811680b4f7681b8cee7835b930ca3800fd6e1d159a785a3b4ce7a14749d7b15\"" -> "W/\"6f216ae6dab3b10c65721e7b2797a17fc5fff376888b8ef4e086c0473ff84b6d\""
        id          = "1393925"
        name        = "protect-main-branch-kong-openssl-release"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"e0bd1d28fb79a929b36e8071beba883abe2728b474332fd5ddac05b414ed86f4\"" -> "W/\"effa180c43e74b306ffb005a97a003f3e4928e813701a327d80add8f375d84f6\""
        id          = "1393916"
        name        = "protect-main-branch-kong-runtime-release"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"bcf16b2025080407bf5d1d711f1cfc06b14a06b8477c07b5937956f4e01f2ee7\"" -> "W/\"05f1c1fb82e327d05684cc8aae6392c77fa609a66e089edeabfeb1cb6873c241\""
        id          = "1393933"
        name        = "protect-main-branch-template-1-terraform-terraform-plan"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1393928"
      ~ name        = "protect-main-branch-kong-build-images-pre-commit" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-openssl"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1393927"
      ~ name        = "protect-main-branch-kong-openssl-pre-commit" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-runtime"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1393918"
      ~ name        = "protect-main-branch-kong-runtime-pre-commit" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1393934"
      ~ name        = "protect-main-branch-template-1-github-release-pre-commit" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-terraform"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1393937"
      ~ name        = "protect-main-branch-template-1-terraform-pre-commit" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-template"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
        id          = "1393936"
      ~ name        = "protect-main-branch-template-template-pre-commit" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["terraform-github"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_all" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + node_id     = (known after apply)
      + repository  = "terraform-github"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "pre-commit"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-build-images"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1393924"
      ~ name        = "protect-main-branch-kong-build-images-release" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-openssl"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1393925"
      ~ name        = "protect-main-branch-kong-openssl-release" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-runtime"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
        id          = "1393916"
      ~ name        = "protect-main-branch-kong-runtime-release" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["multi-arch-fpm"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_kong" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + node_id     = (known after apply)
      + repository  = "multi-arch-fpm"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "Done"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_terraform["template-1-terraform"] will be updated in-place
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
        id          = "1393933"
      ~ name        = "protect-main-branch-template-1-terraform-terraform-plan" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["terraform-github"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_terraform" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + node_id     = (known after apply)
      + repository  = "terraform-github"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "terraform"
                  + integration_id = 0
                }
            }
        }
    }

Plan: 3 to add, 10 to change, 0 to destroy.

<!-- Sticky Pull Request Commentterraform-plan -->